УТ_для_edt/src/Documents/смартASP_БонусыДопЗаслуги/смартASP_БонусыДопЗаслуги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартASP_БонусыДопЗаслуги</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <registerRecords>AccumulationRegister.смартASP_НакоплениеБонусов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРаспределения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СреднийКурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусРасчетаБонусов</name>
    <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
    <type>
      <types>EnumRef.смартСтатусыДокументовРасчетаБонусов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Инженер</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Бонус</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/InformationRegisters/смартASP_БонусныйФонд/смартASP_БонусныйФонд.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартASP_БонусныйФонд</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Коэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Категория</name>
    <type>
      <types>EnumRef.смартASP_Константы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/Enums/смартASP_Константы/смартASP_Константы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартASP_Константы</name>
  <comment>//доработка внешней компании Асиситпро по проекту Бонусы инженеров</comment>
  <enumValues>
    <name>ПроцентОборотаБонусныйФонд</name>
  </enumValues>
  <enumValues>
    <name>ПроцентОборотаБФСЦ</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/смартСтатусыДокументовРасчетаБонусов/смартСтатусыДокументовРасчетаБонусов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыДокументовРасчетаБонусов</name>
  <comment>#1288 Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров</comment>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>РасчетЗавершен</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартASP_БонусыДопЗаслуги/Forms/ФормаДокумента/Module.bsl
//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура  РассчитатьНаСервере()
	СтруктураДанныхПоОбороту = смартASP_ОбщийМодуль.ASP_ПолучитьДанныеОборотаПоРемонтнымРаботам(Объект.Дата,, Объект.СреднийКурсВалюты);
	Если Не СтруктураДанныхПоОбороту=Неопределено Тогда
		Если СтруктураДанныхПоОбороту.Выручка = Null  Тогда
			Сообщить("Нет данных по обороту!");
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ASP_БонусныйФондСрезПоследних.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.смартASP_БонусныйФонд.СрезПоследних(&Дат, ) КАК ASP_БонусныйФондСрезПоследних
		|ГДЕ
		|	ASP_БонусныйФондСрезПоследних.Категория = &Категория";
	
	Запрос.УстановитьПараметр("Категория",Перечисления.смартASP_Константы.ПроцентОборотаБФСЦ);
	Запрос.УстановитьПараметр("Дат",КонецМесяца(Объект.Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		КоэффициентКатегории = Выборка.Коэффициент;
	Иначе
		КоэффициентКатегории = 0;
	КонецЕсли;
	Объект.СуммаРаспределения=СтруктураДанныхПоОбороту.Выручка*КоэффициентКатегории/100;

	//++#1288 смарт: Лопато 29.12.2022 //Дополннение в блоке расчета бонусов инженеров
	Модифицированность = Истина;
	//--#1288 смарт: Лопато 29.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура РассчитатьДоступнуюСумму(Команда)
	РассчитатьНаСервере();
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = ТекущаяДата();
		Объект.Автор = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;

	//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров  
	Если НЕ ЗначениеЗаполнено(Объект.смартСтатусРасчетаБонусов) Тогда
		Объект.смартСтатусРасчетаБонусов = Перечисления.смартСтатусыДокументовРасчетаБонусов.ВРаботе;
	КонецЕсли;	
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды	

	УстановитьДоступностьПоСтатусуРасчета();
	//--#1288 смарт: Лопато 26.12.2022
	
КонецПроцедуры

//доработка внешней компании Асиситпро по проекту Бонусы инженеров
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Объект.Номер = ""
КонецПроцедуры

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура УстановитьДоступностьПоСтатусуРасчета()

	смартASP_ОбщийМодуль.смартУстановитьТолькоПросмотрФормыРасчетЗавершен(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ПодключаемыеКоманды") Тогда
		МодульПодключаемыеКомандыКлиент = ОбщегоНазначенияКлиент.ОбщийМодуль("ПодключаемыеКомандыКлиент");
		МодульПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьДоступностьПоСтатусуРасчета();

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПриОткрытии(Отказ)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#Область ПодключаемыеКоманды

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти

#Область ОбработчикиКомандФормы

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

//++#1288 смарт: Лопато 26.12.2022 //Дополннение в блоке расчета бонусов инженеров
&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры //--#1288 смарт: Лопато 26.12.2022

#КонецОбласти
